backend/tests/load/reports/output_Feed Browsing_20251216_215538.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: backend/tests/load/scenarios/feed_browsing.js
        output: -

     scenarios: (100.00%) 1 scenario, 100 max VUs, 4m30s max duration (incl. graceful stop):
              * default: Up to 100 looping VUs for 4m0s over 4 stages (gracefulRampDown: 30s, gracefulStop: 30s)

time="2025-12-16T21:55:39Z" level=info msg="Starting load test for feed endpoint" source=console
time="2025-12-16T21:55:39Z" level=info msg="Target URL: http://localhost:8080" source=console

running (0m01.0s), 002/100 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 002/100 VUs  0m01.0s/4m00.0s

running (0m02.0s), 004/100 VUs, 1 complete and 0 interrupted iterations
default   [   1% ] 004/100 VUs  0m02.0s/4m00.0s

running (0m03.0s), 005/100 VUs, 2 complete and 0 interrupted iterations
default   [   1% ] 005/100 VUs  0m03.0s/4m00.0s

running (0m04.0s), 007/100 VUs, 4 complete and 0 interrupted iterations
default   [   2% ] 007/100 VUs  0m04.0s/4m00.0s

running (0m05.0s), 009/100 VUs, 9 complete and 0 interrupted iterations
default   [   2% ] 009/100 VUs  0m05.0s/4m00.0s

running (0m06.0s), 010/100 VUs, 10 complete and 0 interrupted iterations
default   [   2% ] 010/100 VUs  0m06.0s/4m00.0s

running (0m07.0s), 012/100 VUs, 17 complete and 0 interrupted iterations
default   [   3% ] 012/100 VUs  0m07.0s/4m00.0s

running (0m08.0s), 014/100 VUs, 24 complete and 0 interrupted iterations
default   [   3% ] 014/100 VUs  0m08.0s/4m00.0s

running (0m09.0s), 015/100 VUs, 27 complete and 0 interrupted iterations
default   [   4% ] 015/100 VUs  0m09.0s/4m00.0s

running (0m10.0s), 017/100 VUs, 35 complete and 0 interrupted iterations
default   [   4% ] 017/100 VUs  0m10.0s/4m00.0s

running (0m11.0s), 018/100 VUs, 43 complete and 0 interrupted iterations
default   [   5% ] 018/100 VUs  0m11.0s/4m00.0s

running (0m12.0s), 020/100 VUs, 50 complete and 0 interrupted iterations
default   [   5% ] 020/100 VUs  0m12.0s/4m00.0s

running (0m13.0s), 022/100 VUs, 59 complete and 0 interrupted iterations
default   [   5% ] 022/100 VUs  0m13.0s/4m00.0s

running (0m14.0s), 023/100 VUs, 69 complete and 0 interrupted iterations
default   [   6% ] 023/100 VUs  0m14.0s/4m00.0s

running (0m15.0s), 025/100 VUs, 80 complete and 0 interrupted iterations
default   [   6% ] 025/100 VUs  0m15.0s/4m00.0s

running (0m16.0s), 027/100 VUs, 91 complete and 0 interrupted iterations
default   [   7% ] 027/100 VUs  0m16.0s/4m00.0s

running (0m17.0s), 028/100 VUs, 105 complete and 0 interrupted iterations
default   [   7% ] 028/100 VUs  0m17.0s/4m00.0s

running (0m18.0s), 030/100 VUs, 121 complete and 0 interrupted iterations
default   [   7% ] 030/100 VUs  0m18.0s/4m00.0s

running (0m19.0s), 032/100 VUs, 135 complete and 0 interrupted iterations
default   [   8% ] 032/100 VUs  0m19.0s/4m00.0s

running (0m20.0s), 033/100 VUs, 149 complete and 0 interrupted iterations
default   [   8% ] 033/100 VUs  0m20.0s/4m00.0s

running (0m21.0s), 035/100 VUs, 167 complete and 0 interrupted iterations
default   [   9% ] 035/100 VUs  0m21.0s/4m00.0s

running (0m22.0s), 036/100 VUs, 183 complete and 0 interrupted iterations
default   [   9% ] 036/100 VUs  0m22.0s/4m00.0s

running (0m23.0s), 038/100 VUs, 203 complete and 0 interrupted iterations
default   [  10% ] 038/100 VUs  0m23.0s/4m00.0s

running (0m24.0s), 040/100 VUs, 220 complete and 0 interrupted iterations
default   [  10% ] 040/100 VUs  0m24.0s/4m00.0s

running (0m25.0s), 041/100 VUs, 243 complete and 0 interrupted iterations
default   [  10% ] 041/100 VUs  0m25.0s/4m00.0s

running (0m26.0s), 043/100 VUs, 257 complete and 0 interrupted iterations
default   [  11% ] 043/100 VUs  0m26.0s/4m00.0s

running (0m27.0s), 045/100 VUs, 279 complete and 0 interrupted iterations
default   [  11% ] 045/100 VUs  0m27.0s/4m00.0s

running (0m28.0s), 046/100 VUs, 302 complete and 0 interrupted iterations
default   [  12% ] 046/100 VUs  0m28.0s/4m00.0s

running (0m29.0s), 048/100 VUs, 328 complete and 0 interrupted iterations
default   [  12% ] 048/100 VUs  0m29.0s/4m00.0s

running (0m30.0s), 049/100 VUs, 350 complete and 0 interrupted iterations
default   [  12% ] 049/100 VUs  0m30.0s/4m00.0s

running (0m31.0s), 050/100 VUs, 378 complete and 0 interrupted iterations
default   [  13% ] 050/100 VUs  0m31.0s/4m00.0s

running (0m32.0s), 051/100 VUs, 401 complete and 0 interrupted iterations
default   [  13% ] 051/100 VUs  0m32.0s/4m00.0s

running (0m33.0s), 052/100 VUs, 428 complete and 0 interrupted iterations
default   [  14% ] 052/100 VUs  0m33.0s/4m00.0s

running (0m34.0s), 053/100 VUs, 454 complete and 0 interrupted iterations
default   [  14% ] 053/100 VUs  0m34.0s/4m00.0s

running (0m35.0s), 054/100 VUs, 480 complete and 0 interrupted iterations
default   [  15% ] 054/100 VUs  0m35.0s/4m00.0s

running (0m36.0s), 054/100 VUs, 505 complete and 0 interrupted iterations
default   [  15% ] 054/100 VUs  0m36.0s/4m00.0s

running (0m37.0s), 055/100 VUs, 533 complete and 0 interrupted iterations
default   [  15% ] 055/100 VUs  0m37.0s/4m00.0s

running (0m38.0s), 056/100 VUs, 559 complete and 0 interrupted iterations
default   [  16% ] 056/100 VUs  0m38.0s/4m00.0s

running (0m39.0s), 057/100 VUs, 588 complete and 0 interrupted iterations
default   [  16% ] 057/100 VUs  0m39.0s/4m00.0s

running (0m40.0s), 058/100 VUs, 612 complete and 0 interrupted iterations
default   [  17% ] 058/100 VUs  0m40.0s/4m00.0s

running (0m41.0s), 059/100 VUs, 642 complete and 0 interrupted iterations
default   [  17% ] 059/100 VUs  0m41.0s/4m00.0s

running (0m42.0s), 059/100 VUs, 666 complete and 0 interrupted iterations
default   [  17% ] 059/100 VUs  0m42.0s/4m00.0s

running (0m43.0s), 060/100 VUs, 702 complete and 0 interrupted iterations
default   [  18% ] 060/100 VUs  0m43.0s/4m00.0s

running (0m44.0s), 061/100 VUs, 728 complete and 0 interrupted iterations
default   [  18% ] 061/100 VUs  0m44.0s/4m00.0s

running (0m45.0s), 062/100 VUs, 754 complete and 0 interrupted iterations
default   [  19% ] 062/100 VUs  0m45.0s/4m00.0s

running (0m46.0s), 063/100 VUs, 785 complete and 0 interrupted iterations
default   [  19% ] 063/100 VUs  0m46.0s/4m00.0s

running (0m47.0s), 064/100 VUs, 818 complete and 0 interrupted iterations
default   [  20% ] 064/100 VUs  0m47.0s/4m00.0s

running (0m48.0s), 064/100 VUs, 854 complete and 0 interrupted iterations
default   [  20% ] 064/100 VUs  0m48.0s/4m00.0s

running (0m49.0s), 065/100 VUs, 884 complete and 0 interrupted iterations
default   [  20% ] 065/100 VUs  0m49.0s/4m00.0s

running (0m50.0s), 066/100 VUs, 912 complete and 0 interrupted iterations
default   [  21% ] 066/100 VUs  0m50.0s/4m00.0s

running (0m51.0s), 067/100 VUs, 954 complete and 0 interrupted iterations
default   [  21% ] 067/100 VUs  0m51.0s/4m00.0s

running (0m52.0s), 068/100 VUs, 985 complete and 0 interrupted iterations
default   [  22% ] 068/100 VUs  0m52.0s/4m00.0s

running (0m53.0s), 069/100 VUs, 1016 complete and 0 interrupted iterations
default   [  22% ] 069/100 VUs  0m53.0s/4m00.0s

running (0m54.0s), 069/100 VUs, 1055 complete and 0 interrupted iterations
default   [  22% ] 069/100 VUs  0m54.0s/4m00.0s

running (0m55.0s), 070/100 VUs, 1092 complete and 0 interrupted iterations
default   [  23% ] 070/100 VUs  0m55.0s/4m00.0s

running (0m56.0s), 071/100 VUs, 1129 complete and 0 interrupted iterations
default   [  23% ] 071/100 VUs  0m56.0s/4m00.0s

running (0m57.0s), 072/100 VUs, 1164 complete and 0 interrupted iterations
default   [  24% ] 072/100 VUs  0m57.0s/4m00.0s

running (0m58.0s), 073/100 VUs, 1199 complete and 0 interrupted iterations
default   [  24% ] 073/100 VUs  0m58.0s/4m00.0s

running (0m59.0s), 074/100 VUs, 1235 complete and 0 interrupted iterations
default   [  25% ] 074/100 VUs  0m59.0s/4m00.0s

running (1m00.0s), 074/100 VUs, 1272 complete and 0 interrupted iterations
default   [  25% ] 074/100 VUs  1m00.0s/4m00.0s

running (1m01.0s), 075/100 VUs, 1310 complete and 0 interrupted iterations
default   [  25% ] 075/100 VUs  1m01.0s/4m00.0s

running (1m02.0s), 076/100 VUs, 1353 complete and 0 interrupted iterations
default   [  26% ] 076/100 VUs  1m02.0s/4m00.0s

running (1m03.0s), 077/100 VUs, 1389 complete and 0 interrupted iterations
default   [  26% ] 077/100 VUs  1m03.0s/4m00.0s

running (1m04.0s), 078/100 VUs, 1427 complete and 0 interrupted iterations
default   [  27% ] 078/100 VUs  1m04.0s/4m00.0s

running (1m05.0s), 079/100 VUs, 1462 complete and 0 interrupted iterations
default   [  27% ] 079/100 VUs  1m05.0s/4m00.0s

running (1m06.0s), 079/100 VUs, 1500 complete and 0 interrupted iterations
default   [  27% ] 079/100 VUs  1m06.0s/4m00.0s

running (1m07.0s), 080/100 VUs, 1543 complete and 0 interrupted iterations
default   [  28% ] 080/100 VUs  1m07.0s/4m00.0s

running (1m08.0s), 081/100 VUs, 1579 complete and 0 interrupted iterations
default   [  28% ] 081/100 VUs  1m08.0s/4m00.0s

running (1m09.0s), 082/100 VUs, 1627 complete and 0 interrupted iterations
default   [  29% ] 082/100 VUs  1m09.0s/4m00.0s

running (1m10.0s), 083/100 VUs, 1667 complete and 0 interrupted iterations
default   [  29% ] 083/100 VUs  1m10.0s/4m00.0s

running (1m11.0s), 084/100 VUs, 1712 complete and 0 interrupted iterations
default   [  30% ] 084/100 VUs  1m11.0s/4m00.0s

running (1m12.0s), 084/100 VUs, 1749 complete and 0 interrupted iterations
default   [  30% ] 084/100 VUs  1m12.0s/4m00.0s

running (1m13.0s), 085/100 VUs, 1789 complete and 0 interrupted iterations
default   [  30% ] 085/100 VUs  1m13.0s/4m00.0s

running (1m14.0s), 086/100 VUs, 1833 complete and 0 interrupted iterations
default   [  31% ] 086/100 VUs  1m14.0s/4m00.0s

running (1m15.0s), 087/100 VUs, 1886 complete and 0 interrupted iterations
default   [  31% ] 087/100 VUs  1m15.0s/4m00.0s

running (1m16.0s), 088/100 VUs, 1931 complete and 0 interrupted iterations
default   [  32% ] 088/100 VUs  1m16.0s/4m00.0s

running (1m17.0s), 089/100 VUs, 1970 complete and 0 interrupted iterations
default   [  32% ] 089/100 VUs  1m17.0s/4m00.0s

running (1m18.0s), 089/100 VUs, 2017 complete and 0 interrupted iterations
default   [  32% ] 089/100 VUs  1m18.0s/4m00.0s

running (1m19.0s), 090/100 VUs, 2065 complete and 0 interrupted iterations
default   [  33% ] 090/100 VUs  1m19.0s/4m00.0s

running (1m20.0s), 091/100 VUs, 2108 complete and 0 interrupted iterations
default   [  33% ] 091/100 VUs  1m20.0s/4m00.0s

running (1m21.0s), 092/100 VUs, 2151 complete and 0 interrupted iterations
default   [  34% ] 092/100 VUs  1m21.0s/4m00.0s

running (1m22.0s), 093/100 VUs, 2199 complete and 0 interrupted iterations
default   [  34% ] 093/100 VUs  1m22.0s/4m00.0s

running (1m23.0s), 094/100 VUs, 2249 complete and 0 interrupted iterations
default   [  35% ] 094/100 VUs  1m23.0s/4m00.0s

running (1m24.0s), 094/100 VUs, 2295 complete and 0 interrupted iterations
default   [  35% ] 094/100 VUs  1m24.0s/4m00.0s

running (1m25.0s), 095/100 VUs, 2342 complete and 0 interrupted iterations
default   [  35% ] 095/100 VUs  1m25.0s/4m00.0s

running (1m26.0s), 096/100 VUs, 2388 complete and 0 interrupted iterations
default   [  36% ] 096/100 VUs  1m26.0s/4m00.0s

running (1m27.0s), 097/100 VUs, 2443 complete and 0 interrupted iterations
default   [  36% ] 097/100 VUs  1m27.0s/4m00.0s

running (1m28.0s), 098/100 VUs, 2491 complete and 0 interrupted iterations
default   [  37% ] 098/100 VUs  1m28.0s/4m00.0s

running (1m29.0s), 099/100 VUs, 2538 complete and 0 interrupted iterations
default   [  37% ] 099/100 VUs  1m29.0s/4m00.0s

running (1m30.0s), 099/100 VUs, 2581 complete and 0 interrupted iterations
default   [  37% ] 099/100 VUs  1m30.0s/4m00.0s

running (1m31.0s), 100/100 VUs, 2636 complete and 0 interrupted iterations
default   [  38% ] 100/100 VUs  1m31.0s/4m00.0s

running (1m32.0s), 100/100 VUs, 2675 complete and 0 interrupted iterations
default   [  38% ] 100/100 VUs  1m32.0s/4m00.0s

running (1m33.0s), 100/100 VUs, 2734 complete and 0 interrupted iterations
default   [  39% ] 100/100 VUs  1m33.0s/4m00.0s

running (1m34.0s), 100/100 VUs, 2780 complete and 0 interrupted iterations
default   [  39% ] 100/100 VUs  1m34.0s/4m00.0s

running (1m35.0s), 100/100 VUs, 2834 complete and 0 interrupted iterations
default   [  40% ] 100/100 VUs  1m35.0s/4m00.0s

running (1m36.0s), 100/100 VUs, 2882 complete and 0 interrupted iterations
default   [  40% ] 100/100 VUs  1m36.0s/4m00.0s

running (1m37.0s), 100/100 VUs, 2930 complete and 0 interrupted iterations
default   [  40% ] 100/100 VUs  1m37.0s/4m00.0s

running (1m38.0s), 100/100 VUs, 2983 complete and 0 interrupted iterations
default   [  41% ] 100/100 VUs  1m38.0s/4m00.0s

running (1m39.0s), 100/100 VUs, 3031 complete and 0 interrupted iterations
default   [  41% ] 100/100 VUs  1m39.0s/4m00.0s

running (1m40.0s), 100/100 VUs, 3080 complete and 0 interrupted iterations
default   [  42% ] 100/100 VUs  1m40.0s/4m00.0s

running (1m41.0s), 100/100 VUs, 3132 complete and 0 interrupted iterations
default   [  42% ] 100/100 VUs  1m41.0s/4m00.0s

running (1m42.0s), 100/100 VUs, 3183 complete and 0 interrupted iterations
default   [  42% ] 100/100 VUs  1m42.0s/4m00.0s

running (1m43.0s), 100/100 VUs, 3229 complete and 0 interrupted iterations
default   [  43% ] 100/100 VUs  1m43.0s/4m00.0s

running (1m44.0s), 100/100 VUs, 3277 complete and 0 interrupted iterations
default   [  43% ] 100/100 VUs  1m44.0s/4m00.0s

running (1m45.0s), 100/100 VUs, 3335 complete and 0 interrupted iterations
default   [  44% ] 100/100 VUs  1m45.0s/4m00.0s

running (1m46.0s), 100/100 VUs, 3383 complete and 0 interrupted iterations
default   [  44% ] 100/100 VUs  1m46.0s/4m00.0s

running (1m47.0s), 100/100 VUs, 3431 complete and 0 interrupted iterations
default   [  45% ] 100/100 VUs  1m47.0s/4m00.0s

running (1m48.0s), 100/100 VUs, 3481 complete and 0 interrupted iterations
default   [  45% ] 100/100 VUs  1m48.0s/4m00.0s

running (1m49.0s), 100/100 VUs, 3529 complete and 0 interrupted iterations
default   [  45% ] 100/100 VUs  1m49.0s/4m00.0s

running (1m50.0s), 100/100 VUs, 3577 complete and 0 interrupted iterations
default   [  46% ] 100/100 VUs  1m50.0s/4m00.0s

running (1m51.0s), 100/100 VUs, 3631 complete and 0 interrupted iterations
default   [  46% ] 100/100 VUs  1m51.0s/4m00.0s

running (1m52.0s), 100/100 VUs, 3679 complete and 0 interrupted iterations
default   [  47% ] 100/100 VUs  1m52.0s/4m00.0s

running (1m53.0s), 100/100 VUs, 3729 complete and 0 interrupted iterations
default   [  47% ] 100/100 VUs  1m53.0s/4m00.0s

running (1m54.0s), 100/100 VUs, 3783 complete and 0 interrupted iterations
default   [  47% ] 100/100 VUs  1m54.0s/4m00.0s

running (1m55.0s), 100/100 VUs, 3831 complete and 0 interrupted iterations
default   [  48% ] 100/100 VUs  1m55.0s/4m00.0s

running (1m56.0s), 100/100 VUs, 3889 complete and 0 interrupted iterations
default   [  48% ] 100/100 VUs  1m56.0s/4m00.0s

running (1m57.0s), 100/100 VUs, 3939 complete and 0 interrupted iterations
default   [  49% ] 100/100 VUs  1m57.0s/4m00.0s

running (1m58.0s), 100/100 VUs, 3990 complete and 0 interrupted iterations
default   [  49% ] 100/100 VUs  1m58.0s/4m00.0s

running (1m59.0s), 100/100 VUs, 4037 complete and 0 interrupted iterations
default   [  50% ] 100/100 VUs  1m59.0s/4m00.0s

running (2m00.0s), 100/100 VUs, 4082 complete and 0 interrupted iterations
default   [  50% ] 100/100 VUs  2m00.0s/4m00.0s

running (2m01.0s), 100/100 VUs, 4127 complete and 0 interrupted iterations
default   [  50% ] 100/100 VUs  2m01.0s/4m00.0s

running (2m02.0s), 100/100 VUs, 4183 complete and 0 interrupted iterations
default   [  51% ] 100/100 VUs  2m02.0s/4m00.0s

running (2m03.0s), 100/100 VUs, 4234 complete and 0 interrupted iterations
default   [  51% ] 100/100 VUs  2m03.0s/4m00.0s

running (2m04.0s), 100/100 VUs, 4281 complete and 0 interrupted iterations
default   [  52% ] 100/100 VUs  2m04.0s/4m00.0s

running (2m05.0s), 100/100 VUs, 4325 complete and 0 interrupted iterations
default   [  52% ] 100/100 VUs  2m05.0s/4m00.0s

running (2m06.0s), 100/100 VUs, 4391 complete and 0 interrupted iterations
default   [  52% ] 100/100 VUs  2m06.0s/4m00.0s

running (2m07.0s), 100/100 VUs, 4437 complete and 0 interrupted iterations
default   [  53% ] 100/100 VUs  2m07.0s/4m00.0s

running (2m08.0s), 100/100 VUs, 4492 complete and 0 interrupted iterations
default   [  53% ] 100/100 VUs  2m08.0s/4m00.0s

running (2m09.0s), 100/100 VUs, 4534 complete and 0 interrupted iterations
default   [  54% ] 100/100 VUs  2m09.0s/4m00.0s

running (2m10.0s), 100/100 VUs, 4583 complete and 0 interrupted iterations
default   [  54% ] 100/100 VUs  2m10.0s/4m00.0s

running (2m11.0s), 100/100 VUs, 4641 complete and 0 interrupted iterations
default   [  55% ] 100/100 VUs  2m11.0s/4m00.0s

running (2m12.0s), 100/100 VUs, 4690 complete and 0 interrupted iterations
default   [  55% ] 100/100 VUs  2m12.0s/4m00.0s

running (2m13.0s), 100/100 VUs, 4744 complete and 0 interrupted iterations
default   [  55% ] 100/100 VUs  2m13.0s/4m00.0s

running (2m14.0s), 100/100 VUs, 4790 complete and 0 interrupted iterations
default   [  56% ] 100/100 VUs  2m14.0s/4m00.0s

running (2m15.0s), 100/100 VUs, 4845 complete and 0 interrupted iterations
default   [  56% ] 100/100 VUs  2m15.0s/4m00.0s

running (2m16.0s), 100/100 VUs, 4894 complete and 0 interrupted iterations
default   [  57% ] 100/100 VUs  2m16.0s/4m00.0s

running (2m17.0s), 100/100 VUs, 4941 complete and 0 interrupted iterations
default   [  57% ] 100/100 VUs  2m17.0s/4m00.0s

running (2m18.0s), 100/100 VUs, 4995 complete and 0 interrupted iterations
default   [  57% ] 100/100 VUs  2m18.0s/4m00.0s

running (2m19.0s), 100/100 VUs, 5047 complete and 0 interrupted iterations
default   [  58% ] 100/100 VUs  2m19.0s/4m00.0s

running (2m20.0s), 100/100 VUs, 5094 complete and 0 interrupted iterations
default   [  58% ] 100/100 VUs  2m20.0s/4m00.0s

running (2m21.0s), 100/100 VUs, 5147 complete and 0 interrupted iterations
default   [  59% ] 100/100 VUs  2m21.0s/4m00.0s

running (2m22.0s), 100/100 VUs, 5192 complete and 0 interrupted iterations
default   [  59% ] 100/100 VUs  2m22.0s/4m00.0s

running (2m23.0s), 100/100 VUs, 5246 complete and 0 interrupted iterations
default   [  60% ] 100/100 VUs  2m23.0s/4m00.0s

running (2m24.0s), 100/100 VUs, 5294 complete and 0 interrupted iterations
default   [  60% ] 100/100 VUs  2m24.0s/4m00.0s

running (2m25.0s), 100/100 VUs, 5343 complete and 0 interrupted iterations
default   [  60% ] 100/100 VUs  2m25.0s/4m00.0s

running (2m26.0s), 100/100 VUs, 5396 complete and 0 interrupted iterations
default   [  61% ] 100/100 VUs  2m26.0s/4m00.0s

running (2m27.0s), 100/100 VUs, 5444 complete and 0 interrupted iterations
default   [  61% ] 100/100 VUs  2m27.0s/4m00.0s

running (2m28.0s), 100/100 VUs, 5492 complete and 0 interrupted iterations
default   [  62% ] 100/100 VUs  2m28.0s/4m00.0s

running (2m29.0s), 100/100 VUs, 5536 complete and 0 interrupted iterations
default   [  62% ] 100/100 VUs  2m29.0s/4m00.0s

running (2m30.0s), 100/100 VUs, 5592 complete and 0 interrupted iterations
default   [  62% ] 100/100 VUs  2m30.0s/4m00.0s

running (2m31.0s), 100/100 VUs, 5638 complete and 0 interrupted iterations
default   [  63% ] 100/100 VUs  2m31.0s/4m00.0s

running (2m32.0s), 100/100 VUs, 5687 complete and 0 interrupted iterations
default   [  63% ] 100/100 VUs  2m32.0s/4m00.0s

running (2m33.0s), 100/100 VUs, 5739 complete and 0 interrupted iterations
default   [  64% ] 100/100 VUs  2m33.0s/4m00.0s

running (2m34.0s), 100/100 VUs, 5786 complete and 0 interrupted iterations
default   [  64% ] 100/100 VUs  2m34.0s/4m00.0s

running (2m35.0s), 100/100 VUs, 5838 complete and 0 interrupted iterations
default   [  65% ] 100/100 VUs  2m35.0s/4m00.0s

running (2m36.0s), 100/100 VUs, 5881 complete and 0 interrupted iterations
default   [  65% ] 100/100 VUs  2m36.0s/4m00.0s

running (2m37.0s), 100/100 VUs, 5933 complete and 0 interrupted iterations
default   [  65% ] 100/100 VUs  2m37.0s/4m00.0s

running (2m38.0s), 100/100 VUs, 5982 complete and 0 interrupted iterations
default   [  66% ] 100/100 VUs  2m38.0s/4m00.0s

running (2m39.0s), 100/100 VUs, 6027 complete and 0 interrupted iterations
default   [  66% ] 100/100 VUs  2m39.0s/4m00.0s

running (2m40.0s), 100/100 VUs, 6081 complete and 0 interrupted iterations
default   [  67% ] 100/100 VUs  2m40.0s/4m00.0s

running (2m41.0s), 100/100 VUs, 6130 complete and 0 interrupted iterations
default   [  67% ] 100/100 VUs  2m41.0s/4m00.0s

running (2m42.0s), 100/100 VUs, 6180 complete and 0 interrupted iterations
default   [  67% ] 100/100 VUs  2m42.0s/4m00.0s

running (2m43.0s), 100/100 VUs, 6224 complete and 0 interrupted iterations
default   [  68% ] 100/100 VUs  2m43.0s/4m00.0s

running (2m44.0s), 100/100 VUs, 6276 complete and 0 interrupted iterations
default   [  68% ] 100/100 VUs  2m44.0s/4m00.0s

running (2m45.0s), 100/100 VUs, 6331 complete and 0 interrupted iterations
default   [  69% ] 100/100 VUs  2m45.0s/4m00.0s

running (2m46.0s), 100/100 VUs, 6377 complete and 0 interrupted iterations
default   [  69% ] 100/100 VUs  2m46.0s/4m00.0s

running (2m47.0s), 100/100 VUs, 6431 complete and 0 interrupted iterations
default   [  70% ] 100/100 VUs  2m47.0s/4m00.0s

running (2m48.0s), 100/100 VUs, 6490 complete and 0 interrupted iterations
default   [  70% ] 100/100 VUs  2m48.0s/4m00.0s

running (2m49.0s), 100/100 VUs, 6534 complete and 0 interrupted iterations
default   [  70% ] 100/100 VUs  2m49.0s/4m00.0s

running (2m50.0s), 100/100 VUs, 6580 complete and 0 interrupted iterations
default   [  71% ] 100/100 VUs  2m50.0s/4m00.0s

running (2m51.0s), 100/100 VUs, 6637 complete and 0 interrupted iterations
default   [  71% ] 100/100 VUs  2m51.0s/4m00.0s

running (2m52.0s), 100/100 VUs, 6684 complete and 0 interrupted iterations
default   [  72% ] 100/100 VUs  2m52.0s/4m00.0s

running (2m53.0s), 100/100 VUs, 6733 complete and 0 interrupted iterations
default   [  72% ] 100/100 VUs  2m53.0s/4m00.0s

running (2m54.0s), 100/100 VUs, 6786 complete and 0 interrupted iterations
default   [  72% ] 100/100 VUs  2m54.0s/4m00.0s

running (2m55.0s), 100/100 VUs, 6833 complete and 0 interrupted iterations
default   [  73% ] 100/100 VUs  2m55.0s/4m00.0s

running (2m56.0s), 100/100 VUs, 6879 complete and 0 interrupted iterations
default   [  73% ] 100/100 VUs  2m56.0s/4m00.0s

running (2m57.0s), 100/100 VUs, 6936 complete and 0 interrupted iterations
default   [  74% ] 100/100 VUs  2m57.0s/4m00.0s

running (2m58.0s), 100/100 VUs, 6988 complete and 0 interrupted iterations
default   [  74% ] 100/100 VUs  2m58.0s/4m00.0s

running (2m59.0s), 100/100 VUs, 7043 complete and 0 interrupted iterations
default   [  75% ] 100/100 VUs  2m59.0s/4m00.0s

running (3m00.0s), 100/100 VUs, 7086 complete and 0 interrupted iterations
default   [  75% ] 100/100 VUs  3m00.0s/4m00.0s

running (3m01.0s), 100/100 VUs, 7139 complete and 0 interrupted iterations
default   [  75% ] 100/100 VUs  3m01.0s/4m00.0s

running (3m02.0s), 100/100 VUs, 7184 complete and 0 interrupted iterations
default   [  76% ] 100/100 VUs  3m02.0s/4m00.0s

running (3m03.0s), 100/100 VUs, 7235 complete and 0 interrupted iterations
default   [  76% ] 100/100 VUs  3m03.0s/4m00.0s

running (3m04.0s), 100/100 VUs, 7286 complete and 0 interrupted iterations
default   [  77% ] 100/100 VUs  3m04.0s/4m00.0s

running (3m05.0s), 100/100 VUs, 7345 complete and 0 interrupted iterations
default   [  77% ] 100/100 VUs  3m05.0s/4m00.0s

running (3m06.0s), 100/100 VUs, 7393 complete and 0 interrupted iterations
default   [  77% ] 100/100 VUs  3m06.0s/4m00.0s

running (3m07.0s), 100/100 VUs, 7445 complete and 0 interrupted iterations
default   [  78% ] 100/100 VUs  3m07.0s/4m00.0s

running (3m08.0s), 100/100 VUs, 7492 complete and 0 interrupted iterations
default   [  78% ] 100/100 VUs  3m08.0s/4m00.0s

running (3m09.0s), 100/100 VUs, 7550 complete and 0 interrupted iterations
default   [  79% ] 100/100 VUs  3m09.0s/4m00.0s

running (3m10.0s), 100/100 VUs, 7594 complete and 0 interrupted iterations
default   [  79% ] 100/100 VUs  3m10.0s/4m00.0s

running (3m11.0s), 100/100 VUs, 7644 complete and 0 interrupted iterations
default   [  80% ] 100/100 VUs  3m11.0s/4m00.0s

running (3m12.0s), 100/100 VUs, 7695 complete and 0 interrupted iterations
default   [  80% ] 100/100 VUs  3m12.0s/4m00.0s

running (3m13.0s), 100/100 VUs, 7746 complete and 0 interrupted iterations
default   [  80% ] 100/100 VUs  3m13.0s/4m00.0s

running (3m14.0s), 100/100 VUs, 7797 complete and 0 interrupted iterations
default   [  81% ] 100/100 VUs  3m14.0s/4m00.0s

running (3m15.0s), 100/100 VUs, 7846 complete and 0 interrupted iterations
default   [  81% ] 100/100 VUs  3m15.0s/4m00.0s

running (3m16.0s), 100/100 VUs, 7886 complete and 0 interrupted iterations
default   [  82% ] 100/100 VUs  3m16.0s/4m00.0s

running (3m17.0s), 100/100 VUs, 7945 complete and 0 interrupted iterations
default   [  82% ] 100/100 VUs  3m17.0s/4m00.0s

running (3m18.0s), 100/100 VUs, 7999 complete and 0 interrupted iterations
default   [  82% ] 100/100 VUs  3m18.0s/4m00.0s

running (3m19.0s), 100/100 VUs, 8045 complete and 0 interrupted iterations
default   [  83% ] 100/100 VUs  3m19.0s/4m00.0s

running (3m20.0s), 100/100 VUs, 8091 complete and 0 interrupted iterations
default   [  83% ] 100/100 VUs  3m20.0s/4m00.0s

running (3m21.0s), 100/100 VUs, 8144 complete and 0 interrupted iterations
default   [  84% ] 100/100 VUs  3m21.0s/4m00.0s

running (3m22.0s), 100/100 VUs, 8195 complete and 0 interrupted iterations
default   [  84% ] 100/100 VUs  3m22.0s/4m00.0s

running (3m23.0s), 100/100 VUs, 8244 complete and 0 interrupted iterations
default   [  85% ] 100/100 VUs  3m23.0s/4m00.0s

running (3m24.0s), 100/100 VUs, 8287 complete and 0 interrupted iterations
default   [  85% ] 100/100 VUs  3m24.0s/4m00.0s

running (3m25.0s), 100/100 VUs, 8341 complete and 0 interrupted iterations
default   [  85% ] 100/100 VUs  3m25.0s/4m00.0s

running (3m26.0s), 100/100 VUs, 8380 complete and 0 interrupted iterations
default   [  86% ] 100/100 VUs  3m26.0s/4m00.0s

running (3m27.0s), 100/100 VUs, 8433 complete and 0 interrupted iterations
default   [  86% ] 100/100 VUs  3m27.0s/4m00.0s

running (3m28.0s), 100/100 VUs, 8477 complete and 0 interrupted iterations
default   [  87% ] 100/100 VUs  3m28.0s/4m00.0s

running (3m29.0s), 100/100 VUs, 8533 complete and 0 interrupted iterations
default   [  87% ] 100/100 VUs  3m29.0s/4m00.0s

running (3m30.0s), 100/100 VUs, 8586 complete and 0 interrupted iterations
default   [  87% ] 100/100 VUs  3m30.0s/4m00.0s

running (3m31.0s), 100/100 VUs, 8633 complete and 0 interrupted iterations
default   [  88% ] 100/100 VUs  3m31.0s/4m00.0s

running (3m32.0s), 098/100 VUs, 8690 complete and 0 interrupted iterations
default   [  88% ] 098/100 VUs  3m32.0s/4m00.0s

running (3m33.0s), 095/100 VUs, 8741 complete and 0 interrupted iterations
default   [  89% ] 095/100 VUs  3m33.0s/4m00.0s

running (3m34.0s), 091/100 VUs, 8785 complete and 0 interrupted iterations
default   [  89% ] 091/100 VUs  3m34.0s/4m00.0s

running (3m35.0s), 088/100 VUs, 8826 complete and 0 interrupted iterations
default   [  90% ] 088/100 VUs  3m35.0s/4m00.0s

running (3m36.0s), 083/100 VUs, 8879 complete and 0 interrupted iterations
default   [  90% ] 083/100 VUs  3m36.0s/4m00.0s

running (3m37.0s), 081/100 VUs, 8915 complete and 0 interrupted iterations
default   [  90% ] 081/100 VUs  3m37.0s/4m00.0s

running (3m38.0s), 076/100 VUs, 8964 complete and 0 interrupted iterations
default   [  91% ] 076/100 VUs  3m38.0s/4m00.0s

running (3m39.0s), 074/100 VUs, 8995 complete and 0 interrupted iterations
default   [  91% ] 074/100 VUs  3m39.0s/4m00.0s

running (3m40.0s), 071/100 VUs, 9039 complete and 0 interrupted iterations
default   [  92% ] 071/100 VUs  3m40.0s/4m00.0s

running (3m41.0s), 067/100 VUs, 9064 complete and 0 interrupted iterations
default   [  92% ] 067/100 VUs  3m41.0s/4m00.0s

running (3m42.0s), 064/100 VUs, 9103 complete and 0 interrupted iterations
default   [  92% ] 064/100 VUs  3m42.0s/4m00.0s

running (3m43.0s), 060/100 VUs, 9134 complete and 0 interrupted iterations
default   [  93% ] 060/100 VUs  3m43.0s/4m00.0s

running (3m44.0s), 058/100 VUs, 9169 complete and 0 interrupted iterations
default   [  93% ] 058/100 VUs  3m44.0s/4m00.0s

running (3m45.0s), 054/100 VUs, 9198 complete and 0 interrupted iterations
default   [  94% ] 054/100 VUs  3m45.0s/4m00.0s

running (3m46.0s), 053/100 VUs, 9224 complete and 0 interrupted iterations
default   [  94% ] 053/100 VUs  3m46.0s/4m00.0s

running (3m47.0s), 047/100 VUs, 9252 complete and 0 interrupted iterations
default   [  95% ] 047/100 VUs  3m47.0s/4m00.0s

running (3m48.0s), 043/100 VUs, 9277 complete and 0 interrupted iterations
default   [  95% ] 043/100 VUs  3m48.0s/4m00.0s

running (3m49.0s), 040/100 VUs, 9295 complete and 0 interrupted iterations
default   [  95% ] 040/100 VUs  3m49.0s/4m00.0s

running (3m50.0s), 036/100 VUs, 9321 complete and 0 interrupted iterations
default   [  96% ] 036/100 VUs  3m50.0s/4m00.0s

running (3m51.0s), 034/100 VUs, 9336 complete and 0 interrupted iterations
default   [  96% ] 034/100 VUs  3m51.0s/4m00.0s

running (3m52.0s), 031/100 VUs, 9356 complete and 0 interrupted iterations
default   [  97% ] 031/100 VUs  3m52.0s/4m00.0s

running (3m53.0s), 027/100 VUs, 9374 complete and 0 interrupted iterations
default   [  97% ] 027/100 VUs  3m53.0s/4m00.0s

running (3m54.0s), 023/100 VUs, 9386 complete and 0 interrupted iterations
default   [  97% ] 023/100 VUs  3m54.0s/4m00.0s

running (3m55.0s), 021/100 VUs, 9400 complete and 0 interrupted iterations
default   [  98% ] 021/100 VUs  3m55.0s/4m00.0s

running (3m56.0s), 019/100 VUs, 9409 complete and 0 interrupted iterations
default   [  98% ] 019/100 VUs  3m56.0s/4m00.0s

running (3m57.0s), 015/100 VUs, 9423 complete and 0 interrupted iterations
default   [  99% ] 015/100 VUs  3m57.0s/4m00.0s

running (3m58.0s), 011/100 VUs, 9429 complete and 0 interrupted iterations
default   [  99% ] 011/100 VUs  3m58.0s/4m00.0s

running (3m59.0s), 006/100 VUs, 9437 complete and 0 interrupted iterations
default   [ 100% ] 006/100 VUs  3m59.0s/4m00.0s

running (4m00.0s), 005/100 VUs, 9440 complete and 0 interrupted iterations
default   [ 100% ] 005/100 VUs  4m00.0s/4m00.0s

running (4m01.0s), 002/100 VUs, 9443 complete and 0 interrupted iterations
default ↓ [ 100% ] 005/100 VUs  4m0s
time="2025-12-16T21:59:40Z" level=info msg="Load test completed" source=console


  █ THRESHOLDS 

    errors
    ✗ 'rate<0.05' rate=89.41%

    http_req_duration
    ✓ 'p(95)<100' p(95)=2.28ms

    http_req_failed
    ✗ 'rate<0.05' rate=89.41%


  █ TOTAL RESULTS 

    checks_total.......: 37780  156.44176/s
    checks_succeeded...: 55.29% 20890 out of 37780
    checks_failed......: 44.70% 16890 out of 37780

    ✗ status is 200
      ↳  10% — ✓ 1000 / ✗ 8445
    ✓ response time < 100ms
    ✓ response time < 50ms
    ✗ has data array
      ↳  10% — ✓ 1000 / ✗ 8445

    CUSTOM
    errors.........................: 89.41% 8445 out of 9445
    feed_load_time.................: avg=0.675824 min=0.356716 med=0.460752 max=7.646932 p(90)=2.115531 p(95)=2.286189

    HTTP
    http_req_duration..............: avg=675.82µs min=356.71µs med=460.75µs max=7.64ms   p(90)=2.11ms   p(95)=2.28ms  
      { expected_response:true }...: avg=2.37ms   min=2.02ms   med=2.27ms   max=7.64ms   p(90)=2.66ms   p(95)=2.8ms   
    http_req_failed................: 89.41% 8445 out of 9445
    http_reqs......................: 9445   39.11044/s

    EXECUTION
    iteration_duration.............: avg=1.99s    min=1s       med=1.99s    max=3s       p(90)=2.79s    p(95)=2.89s   
    iterations.....................: 9445   39.11044/s
    vus............................: 2      min=2            max=100
    vus_max........................: 100    min=100          max=100

    NETWORK
    data_received..................: 16 MB  68 kB/s
    data_sent......................: 1.2 MB 5.1 kB/s



running (4m01.5s), 000/100 VUs, 9445 complete and 0 interrupted iterations
default ✓ [ 100% ] 000/100 VUs  4m0s
time="2025-12-16T21:59:40Z" level=error msg="thresholds on metrics 'errors, http_req_failed' have been crossed"